

// ДЗ 10.2. Отримання парних чисел з масиву
// Маєте масив чисел. Використовуйте вже існуючі методи масиву для створення нового масиву, 
// в якому лише парні числа з оригінального масиву.

const arr = [1, 2, true, 5, 6];
// Фильтруем массив, оставляя только четные числа

const filteredArray = arr.filter(item => typeof item === 'number' && item % 2 === 0);

// Используем конструктор Array для создания нового массива
const evenNumbers = new Array(...filteredArray);


console.log(`Виводжу старий массив для наглядності: 
[${arr}]`); // Выведет старый массив [1, 2, true, 5, 6];
console.log(`Це новий массив створений зі старого тільки парні числа: 
[${evenNumbers}]`); // Выведет новый массив  [2, 6]

console.log( `Формула що перевіряє що новий массив не являється старим массивом:  вона повинна бути TRUE: 
  ${evenNumbers!==arr}`);// Проверка на то, что новый массив это не тарый массив